# FillColorByClass

## Description
Sets the default document fill colors to the fill colors of the active class.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE FillColorByClass;
```

```python

def vs.FillColorByClass():
    return None
```

## Remarks
Sets the global attributes to use the fill colors of the default class.<BR>
[sd 8/19/98]

## See Also
VS Functions:
PenColorByClass| MarkerByClass| FPatByClass

## Version
Availability: from VectorWorks8.0
## Category
* Classes